Дошкольное_учреждение83/src/Documents/удуПриказОВыбытииИзГруппы/удуПриказОВыбытииИзГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуПриказОВыбытииИзГруппы</name>
  <registerRecords>InformationRegister.удуСведенияОЗачисленииРебенкаВГруппу</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВыбытия</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВыбытияПоУмолчанию</name>
    <type>
      <types>CatalogRef.удуПричиныВыбытияИзГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическогоВыбытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьВоспитанники</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаВыбытия</name>
      <type>
        <types>CatalogRef.удуПричиныВыбытияИзГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеЗачисленияВГруппу</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/InformationRegisters/удуСведенияОЗачисленииРебенкаВГруппу/удуСведенияОЗачисленииРебенкаВГруппу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСведенияОЗачисленииРебенкаВГруппу</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОснованиеЗачисления</name>
    <type>
      <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеУчетаВГруппе</name>
    <type>
      <types>EnumRef.удуСостояниеРебенкаНаУчетеВГруппе</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаВыбытияИзГруппы</name>
    <type>
      <types>CatalogRef.удуПричиныВыбытияИзГруппы</types>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Enums/удуСостояниеРебенкаНаУчетеВГруппе/удуСостояниеРебенкаНаУчетеВГруппе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуСостояниеРебенкаНаУчетеВГруппе</name>
  <enumValues>
    <name>ПринятВГруппу</name>
  </enumValues>
  <enumValues>
    <name>ИсключенИзГруппы</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Enums/удуСтатусРебенкаВДОУ/удуСтатусРебенкаВДОУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуСтатусРебенкаВДОУ</name>
  <enumValues>
    <name>Кандидат</name>
  </enumValues>
  <enumValues>
    <name>Воспитанник</name>
  </enumValues>
  <enumValues>
    <name>Выпускник</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Documents/удуПриказОВыбытииИзГруппы/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	// проверим корректность заполнения табличной части
	Для Каждого СтрокаВоспитанник Из ТабличнаяЧастьВоспитанники Цикл
		Если Не ЗначениеЗаполнено(СтрокаВоспитанник.Ребенок) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'В строке №" + Строка(СтрокаВоспитанник.НомерСтроки) + " не указан ребенок'");			
			Сообщение.Поле = НСтр("ru = 'ТабличнаяЧастьВоспитанники[" + Строка(СтрокаВоспитанник.НомерСтроки) + "].Ребенок'");
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();			
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаВоспитанник.ПричинаВыбытия) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'В строке №" + Строка(СтрокаВоспитанник.НомерСтроки) + " не указана причина выбытия'");			
			Сообщение.Поле = НСтр("ru = 'ТабличнаяЧастьВоспитанники[" + Строка(СтрокаВоспитанник.НомерСтроки) + "].ПричинаВыбытия'");
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();			
			Отказ = Истина;
		КонецЕсли;		
	КонецЦикла;
	
	// формируем движения по регистру
	Если Не Отказ Тогда
		Движения.удуСведенияОЗачисленииРебенкаВГруппу.Записывать = Истина;
		Для Каждого ТекСтрокаВоспитанник Из ТабличнаяЧастьВоспитанники Цикл
			// регистр удуСведенияОЗачисленииРебенкаВГруппу 
			Движение = Движения.удуСведенияОЗачисленииРебенкаВГруппу.Добавить();
			Движение.Период = ДатаФактическогоВыбытия;
			Движение.Учреждение = Учреждение;
			Движение.Ребенок = ТекСтрокаВоспитанник.Ребенок;
			Движение.Группа = ГруппаВыбытия;
			Движение.ОснованиеЗачисления = ТекСтрокаВоспитанник.ОснованиеЗачисленияВГруппу;
			Движение.ПричинаВыбытияИзГруппы = ТекСтрокаВоспитанник.ПричинаВыбытия;
			Движение.СостояниеУчетаВГруппе = Перечисления.удуСостояниеРебенкаНаУчетеВГруппе.ИсключенИзГруппы;
			
			// если был осуществлен выпуск из группы, сменим статус ребенка
			Если ТекСтрокаВоспитанник.ПричинаВыбытия = Справочники.удуПричиныВыбытияИзГруппы.ВыпускИзДОУ Тогда
				РебенокОбъект = ТекСтрокаВоспитанник.Ребенок.ПолучитьОбъект();
				РебенокОбъект.СтатусРебенка = Перечисления.удуСтатусРебенкаВДОУ.Выпускник;
				РебенокОбъект.Записать();
			КонецЕсли;			
			
			// Изменяем признак отработки договора зачисления
			ДоговорОбъект = ТекСтрокаВоспитанник.ОснованиеЗачисленияВГруппу.ПолучитьОбъект();
			ДоговорОбъект.ПроизошлоОтчисление = Истина;
			ДоговорОбъект.Записать(РежимЗаписиДокумента.Запись);			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Вставить содержимое обработчика.
	Для Каждого ТекСтрокаВоспитанник Из ТабличнаяЧастьВоспитанники Цикл
		// если был осуществлен выпуск из группы, сменим статус ребенка
		Если ТекСтрокаВоспитанник.ПричинаВыбытия = Справочники.удуПричиныВыбытияИзГруппы.ВыпускИзДОУ Тогда
			РебенокОбъект = ТекСтрокаВоспитанник.Ребенок.ПолучитьОбъект();
			РебенокОбъект.СтатусРебенка = Перечисления.удуСтатусРебенкаВДОУ.Воспитанник;
			РебенокОбъект.Записать();
		КонецЕсли;			
		
		// Изменяем признак отработки договора зачисления
		ДоговорОбъект = ТекСтрокаВоспитанник.ОснованиеЗачисленияВГруппу.ПолучитьОбъект();
		ДоговорОбъект.ПроизошлоОтчисление = Ложь;
		ДоговорОбъект.Записать(РежимЗаписиДокумента.Запись);		
	КонецЦикла;
КонецПроцедуры
